// настройки приложения, тексты сообщений об ошибках, селекторы элементов

export default {
  REQUIRED_FIELD: 'Это обязательное поле',
  LENGTH_ERROR: 'Должно быть от 2 до 30 символов',
  INVALID_NAME: 'Некорректное имя',
  INVALID_EMAIL: 'Неправильный формат email',
  INVALID_PASSWORD: 'от 8 символов: заглавная, прописная буква и цифра',
  USER_EXISTS: 'Такой пользователь уже существует',
  INVALID_CREDENTIALS: 'Неправильные email или пароль',
  SOMETHING_WRONG: 'Упс, что-то пошло не так',
  LOADING: 'Загрузка...',
};
