// настройки приложения, тексты сообщений об ошибках, селекторы элементов

export default {
  REQUIRED_FIELD: 'Это обязательное поле',
  LENGTH_ERROR: 'Должно быть от 2 до 30 символов',
  INVALID_NAME: 'Некорректное имя',
  INVALID_EMAIL: 'Неправильный формат email',
  INVALID_PASSWORD: 'от 8 символов: заглавная, прописная буква и цифра',
  USER_EXISTS: 'Такой пользователь уже существует',
  INVALID_CREDENTIALS: 'Неправильные email или пароль',
  SOMETHING_WRONG: 'Упс, что-то пошло не так',
  LOADING: 'Загрузка...',
  UNKNOWN_ERROR: 'Неизвестная ошибка',
  INTERNAL_ERROR: `Во время запроса произошла ошибка. Возможно, проблема
  с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз`,
  NOT_FOUND_ERROR: 'К сожалению по вашему запросу ничего не найдено.',
  NOT_FOUND_TITLE_ERROR: 'Ничего не найдено',
};
